app/controllers/api/products_controller.rb

  def show
    @product = Product.with_attached_photos.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]